[
    {
        "name": "Nvidia GeForce RTX 2060",
        "link": "https://www.ebay.com/urw/ASUS-GeForce-RTX-2060-6GB-GDDR6-Graphics-Card-DUALRTX2060O6GEVO-/product-reviews/22034996112",
        "reviews": [
            "Very nice improvement over my old 1050ti. Able to run games on high or ultra with no issues. Very quiet and fit my motherboard and case with no issues: I was planning to buy a used gpu but saw this offering from ASUS and thought it was the better way to go. Card is a bit larger than my old 1050ti but it fit into my old computer case and motherboard with no problem at all. Card is very quiet. It also has some cool lighting when its activated. So far, I have seen significant improvement in my game play. I have all games bumped up to high or ultra and it has been running perfectly. Reminder: go into your nvidia control center and bump up the performance to get even more out of the card.Read full review...",
            "Better Than a RX-570: I purchased a gaming PC in mid 2020 and I felt that the RX-570 that was included would play most games including the new Flight Simulator 2020. Not really, so I begin looking for a newer graphics card for the last 5 months or so. The prices started coming down and this really is a good deal for this time in 2021. It works very well in Flight Sim and although I am not the best playing this yet, I do love the graphics, pretty much flawless. I do love the way the card handles just about everything you do with it. And, yes a better price might be had, this was good at the time. Thanks Ebay!!Read full review...",
            "Definitely a good buy!: I honestly have no complaints with this GPU. Prices are extremely high currently and so I was forced to buy a GPU that was part of a lesser generation than I wanted. HOWEVER, all things considered, this GPU runs like a beast with almost no sound. I am very happy that I did decide to buy this GPU instead of waiting for the prices to level out more. I definitely recommend this GPU to someone who is either waiting for prices to drop and need a GPU, or for someone is building a mid-range priced computer. Currently, I am running games at their high-end settings and still reaching 100+ frames which is good enough for me. Again, I definitely recommend this GPU!Read full review...",
            "Great GPU: Even though my processor is a small bottleneck, the gpu still works really well and I would recommend it",
            "Worth the money: My son absolutely loves it. He put it in his computer and he his very happy. He says he doesn’t lag with playing games. He also said the price was amazing.",
            "Nice bang for your buck: I love the card. There isn't much I can say about it other than I can run any game I own on ultra settings. Great card.",
            "Quality Preowned Graphics card: The card was in good condition and has run well under moderate to heavy loads for hours at a time.",
            "Great but overpriced.: Great product but the prices on graphics cards are ridiculously high these days. Just glad we could find one in today's market.",
            "Asus RTX 2060 OC Dual: Works well, plays games, gets good fps. Highly recommended. A+ on this one",
            "Great mid range GPU: Great performance and low TDP. This GPU delivers @ 60 frames per sec on my most demanding games.",
            "Very good! The graphics card works fine!...: Very good! The graphics card works fine! Like new!",
            "Thanks. Arrived super quick and will work perfectly for my daughter's PC that I'm building.: Thanks. Arrived super quick and will work perfectly for my daughter's PC that I'm building.",
            "Works great: Works well no problem at all can run my stuff alot been then the last one with no problem. 👌🏾",
            "Pretty standard: It's a little thicker than my other cards, but as long as I keep it at the end of the row it should be fine.",
            "Excellent product!: Great product works great, this is the second purchase I have made from them and all communication was great as well!",
            "Good stuff: Good product!  Performs just as I need it to.  Only complaint is paying 2x msrp, but that’s to be expected in these days…",
            "rtx 2060: Love it 10/10 for the price and performance. A good card that actually works.",
            "Video card: Good card, and easy to install",
            "Great card: Card is obviously over MSRP, but it's a great card.",
            "good quality graphics card: good product",
            "Good condition: Its great and works well",
            "overpriced: Card works good but was way overpriced.",
            "Graphics card: Great video card! Works great.",
            "Very good: It works grate not having any issues",
            "Great card: awesome card I like it",
            "Great value!: Gives my games the boost they need!",
            "Graphics card review: Works like a champ diffidently recommend this.🔥",
            "The card works perfectly fine and good conditions.: The card works perfectly fine and good conditions.",
            "Excellent video card: Works amazing",
            "best value for the $: best value for the $",
            "Great Mid Range Card: This card isn’t the best for getting 200fps on rust but it will do the job if you just want to casually play on any game. I get 100+fps on valorant, 90-120fps on rust and the list goes on. Over all great card for this price!Read full review...",
            "What I expected: Exactly what I was looking for.",
            "good card: good card"
        ]
    },
    {
        "name": "Nvidia GeForce RTX 2070",
        "link": "https://www.ebay.com/urw/EVGA-GeForce-RTX-2070-8GB-GDDR6-Graphics-Card-08GP43173KR-/product-reviews/5033933932",
        "reviews": [
            "Great card for quiet setup: Great card. Runs quiet and 4K at high quality.Would have loved a lower price, but we’re in the middle of a chip shortage.",
            "Outstanding product: Excellent in all respects, but its a power hog. For flight simmers, you'll need a 850 watt PSU if you have a lot of USB devices.",
            "I would purchase again.: EVGA quality and great looks. Performs well and stays at a cool temp with a Gigabyte MB and intel 12600k.",
            "Amd struggled with VR: Went from 5700 xt trying to run vr. It never gave me the performance I wanted.  So far this is great",
            "Noice!: Really good card, however not blower style so ur case will get hot1",
            "Exactly what i ordered: Really a solid and worth while upgrade. The GPU came just as expected, and there is nothing wrong with it in terms of performance.",
            "10/10: Best gpu for the price on the market in my opinion only draw back is if you don't have a reinforced pci slot it will sag",
            "Hold It's Value!: Great card! If your looking for a bridge until you can snag a 30 series, this card will run everything you throw at it.",
            "Very quiet, great performance: Great card. Performs very well. Exceeded my expectations",
            "same card, twice the price....yay.: Great card, comes as advertised. Scalpers go straight up eat a bag of popsicles.",
            "Working good: It was shopped out quick and got here in time. So far working good",
            "Upgraded: Was time to upgrade from my 1060. I've seen better performance",
            "Best one for the money !!!: Awesome GPU.",
            "It's evga, what more is there to say: Awesome item",
            "2070 super for the price of a 2070: turned out to be a 2070 super. 10% more performance.",
            "2070 Super: Great working card for mining,but very overpriced",
            "Great Quality: Great overall performance",
            "Great card: Works well",
            "Amazing: Awesome gpu but the price wasAmazing!!",
            "Great Card: Overclocks well.",
            "None better: A beast....better than the 300's",
            "perfect: perfect",
            "Valve index VR: Works amazing on our valve index"
        ]
    },
    {
        "name": "Nvidia GeForce RTX 2080",
        "link": "https://www.ebay.com/urw/GIGABYTE-NVIDIA-GeForce-RTX-2080-8GB-GDDR6-Graphics-Card-GV-N2080WF3-8GC-/product-reviews/26030527048",
        "reviews": [
            "Decent value for overpriced tech: Entry level 2080.  I was able to use the new EVGA Precision X1 to overclock with the built in scan tools for about 10% more performance.  Great frame rates, maintains over 60, with ultra settings on a UWQHD monitor.  Paid $599, wouldn't spend more.Read full review...",
            "Fast and quiet, good value: I bought this card during the COVID GPU shortage. I paid around $880 for it, which is around $230 over msrp, and I would 100% do it again. It's been a week, and theres been no issues, its quiet, fast and powerful. Theres almost no marks on the card indicating use and it runs everything perfectly. My only concern was the anti-static bag it came in, which had a hole in it. Other than that, 10/10 card, very good value for the time period, would buy again. Read full review...",
            "Amazing!: Got this card as an entry level rtx 2080 and used it as my primary for about 9 months. Everything about my experience with the card has been flawless. The cooling system keeps the card cool under 70 degrees even after 6 hours of game play on ultra graphics. The fans run quiet, even on the most demanding games and the simple rgb colors are perfect for pc enthusiasts who would rather not have their gpu look like a Christmas tree. The only thing I would advise is that you use mai afterburner instead of gigabytes Aorus if you decide to overclock as the application just works better all around. But as for this particular model itself I don't have a single complaint, only praise to Nvidia and gigabyte for the remarkable performance and value this model delivers. I would recommend it to anyone looking for an entry level rtx 2080 as you can find the card used for around 500 and new for under 700.Read full review...",
            "Cane as advertised, great packaging (double boxed with sufficient padding): Cane as advertised, great packaging (double boxed with sufficient padding)",
            "simply great: great",
            "Lowest price at the time and from newegg.: Lowest price at the time and from newegg."
        ]
    },
    {
        "name": "Nvidia GeForce RTX 3060",
        "link": "https://www.ebay.com/urw/EVGA-GeForce-RTX-3060-XC-GAMING-12GB-GDDR6-Graphics-Card-12G-P5-3657-KR-/product-reviews/2315640392",
        "reviews": [
            "I go for the most stable RTX xx60 series. ALWAYS!: Incredibly quiet, in fact I can't hear it at all and I use an open case configuration. Paired up with an AMD 3900x processor overclocked to 4.2ghz successfully on air, and it runs up to 1440p with no lag or issues at all. I upgraded from a RTX1060 and had to restart my computer 3x until it recognized the new (3060) card which was no problem. I prefer the RTX xx60 series because they seem to be the most reliable and also overclock extremely well and last indefinitely so long as you use stabile numbers. If you choose to go crazy then yes anything will burn up. I also chose to wait until well after COVID as the prices on this model were absolutely ridiculous sometime going up to $900. Glad I waited and this one seems to have been barely used if at all. Out of the shipping box it looked brand new and all the fins were super clean. Worth every penny! Runs very smooth, overclocks radically well. I could have gone with an 8Gb model just as easily and for a tiny bit less money but I use Adobe Lightroom for photography and transferring files in RAW, the extra 4Gb of RAM absolutely make a difference in speed. If your not also doing photography or video work the 8Gb is more than enough for even some of the biggest games. 12Gb for me was pretty much mandatory. Read full review...",
            "I reccommend this card.: I have yet to plug it in.  But, we'll be buying more.  With 12 gigs O'RAM, It's really \"Nice\"!!  Now, we'll be doing 4K editing in DaVinci Studio and NO gaming or Over-clocking..  I moved out of my parents basement when I was a Freshman in College.  It's been a few years.  In fact they didn't have video games back then. (grin) Is it a good value?????? I don't think so, but you already know the story on Video Cards today.  You pay your money, you take your chances.. It looks fabulous.  Great build.Read full review...",
            "Worth the money: Works great so far. Definitely brand new. Competitive price considering global chip shortage.",
            "PCs dope, but my banks broke.: This card was no get for davinci resolve due to the amount of VRAM. It’s good so far. The price is absurd right now so wait if you can! I wish I could have.",
            "Came with all paperwork for registering with EVGA: Product came with original box and bill of sale so I was able to register it online with EVGA. Great packaging, clean card and no issues",
            "Good overall: Pros: Powerful and reliableCons: Power cap (limited) for currency mining",
            "Expensive, but worth it.: Besides the inflated price, the card is almost worth the extra you have to pay just to get one.  It can push 3 monitors at once and run my games at the same time without breaking a sweat.",
            "This card is great. It's a huge upgrade from my GTX1060: \"The EVGA GeForce RTX 3060 XC Gaming is an outstanding graphics card that has truly redefined gaming experiences. As an avid gamer, I was eager to put this powerful GPU to the test, and I must say it surpassed all my expectations.First and foremost, the performance of the RTX 3060 XC Gaming is simply exceptional. Equipped with NVIDIA's Ampere architecture, this card delivers a significant boost in frame rates and graphical fidelity compared to its predecessors. Whether I was exploring vast open worlds or engaging in intense multiplayer battles, the smoothness and visual detail were unparalleled\".Read full review...",
            "Ordered as expected!: Order came in new and unopened! Brand new quality and works perfectly in my computer rig.",
            "EVGA GeForce RTX 3060 Graphics Card Works Like A Charm!: I purchased this card as an upgrade for my flight simulator. Even though this is a used card it looks like it just came from the factory and is extremely quite.I really liked the fact that it came with the drivers DVD and no problems at all installing or putting to work.Read full review...",
            "Great performer for small price.: Meh product for the launch prices, an amazing value for ~$250 used. I'm absolutely happy with it and quite enjoy every single aspect of it. As someone who's doing a lot of CG and graphics amount of VRAM is critical for me so that's why I prefer 3060 over 3060 ti. Read full review...",
            "Works great, little tricky to install but does exactly what it should: Was easy to switch out the old one for the new GPU, this one is working well and has no issue with the workload, no complaints and was great to find one in Canada without exuberant shipping.",
            "Nice upgrade from a RTX 2060: This was a nice upgrade from a RTX 2060 that came with the Lenovo computer I got last year. The 2060 was ok but lacked Vram with 6 GB. The 3060 has worked out great. with a hefty 12GB.Very hard to find any descent Graphics card at an affordable price these days.which caused me to get this one preowned with more than two years of the warranty left which wasa bonus.   Read full review...",
            "Over all it does the job: Happy with the video card.  Easy to install and setup.  Video is nice and it runs games very well.",
            "Great GPU -- Still Over Priced: This is a great GPU. I am running multiple monitors from it.  The pricr is excessive still, but not as bad as it was. I would recommend this card.",
            "Works as Expected.: My computer has never ran games with this much power before. My first graphics card and it does a great job. Haven't had any issues running games on the ultra graphics settings.",
            "Gr8: Everything good , except it is LHR !!! Besides being rev 1.0 and KR series.it has to be one previous to April '21. just found out myself",
            "Great GPU: EVGA 3060 XC is a great GPU. Preforms like a 1080 ti, but power efficient. Overclocked video memory +900 with no crashes.",
            "3060 is a great card: Great Card, went from two RX480 cards in crossfire two this single 3060 (from red to blue) and it was a significant upgrade with zero troubles. Love the hardware but today’s pricing is just ridiculous these days. Gamers on a budget are being squeezed out. It’s unfortunate and I hope the industry wakes up tothis problem.Read full review...",
            "Good stuff.: Amazing product. Big ups to the company who sold it at a reasonable price. Thank you a billion!",
            "Perfect: Amazing qualitySuper easy installation Definitely a great alternative to the higher end RTX series GPUs",
            "Purchased for my son. Worth it.: This thing is a beast. I love it. I bought this for my son, and he can play many more games now.",
            "The card works with no issues: The gpu market is crazy right now but that has nothing to do with the performance of the actual product. The card itself works perfectly fine and the product even arrived a day early.",
            "Don't waste your money on overpriced products: ProsGood GPU all round if you need decent RTX Card this is perfect for any PC builder or gamer. Cons There is a problem and shortages of PC GPUs due over whelming demands from crypto miners and scalpers. Sorry but this is not the time for hording GPUs and selling them for absurd prices no gamer should in the right state of mind buy at these prices either.  WAIT DO NOT BUY FROM THESE PEOPLE THEY WILL RESTOCK LATER IN THE YEAR...",
            "Works great and just as described!: While it was a bit overpriced by MSRP standards, it was still reasonable and works as intended! Which is all I can ask for with all the crypto miners out there hogging all the cards",
            "Great value, good entry level upgrade.: For the level of performance I was expecting, and the amount I paid, I am completely satisfied.  It's not the best card on the market, but it is fairly cheap, for today's market, and a fantastic entry point upgrade from the 1000 series cards.",
            "Very low price for the on-board memory: Very low price for the on-board memory",
            "Good card. Little hot: Good card although runs a little hotter than the 3070. Pretty little thing too",
            "Painless process and functional: Was a great deal on an almost impossible to find gpu. Works flawlessly, just need to upgrade my cpu to optimize the specs.",
            "Great buy, great price: Got it quickly, but a great value. When I need cards again I will definitely be looking like your way",
            "Fantastic GPU!: An absolutely fantastic video card if you can get one near MSRP, 12GB of vram, RT & DLSS support, super quiet even under full load. I installed my EVGA RTX 3060 today and I LOVE it! I highly recommend itRead full review...",
            "the item is good: It working well",
            "Just great all over: Best bank for your buck IMO in these covid times.",
            "Evga RTX 3060 12gb: Everything works like a dream and the way it should work no problem. Even have it working off a 600 watt power supply no problem.",
            "Works: Works well. Put it in my PC and I return to terrorizing the gaming world. No problems this far",
            "I had this same graphics card whenever I was new to pc gaming and it was a big jump from a 1650: fast and quiet",
            "Good GPU very efficient and powerful: Would buy again if I need another gpu. Other are just overkill",
            "Reasonable I guess: Nice video card for 1080p and very high and possibly ultra settings.",
            "Good card: Fits in any case, metal back cover, noise ok",
            "Nice card: Very nice graphics card arrived very quickly can run ray tracing on cyberpunk 2077 and guardians of galaxy",
            "Must to gey: I love it it runs perfect",
            "48 Mh, doesn't perform as good as an older 1080 Ti: no complaints, not a bad price (sarc)",
            "Great card way over priced: The 3060 works great but price is outrageous bought out of need to meet a deadline",
            "VERY NICE EVGA 3060GeForce GTX card! Came with the original box and manual and packed properly. Thank you!: VERY NICE EVGA 3060GeForce GTX card! Came with the original box and manual and packed properly. Thank you!",
            "great card: awsome  graphic and easy to install",
            "Good card with steap price: Love the card but not the price. Still the cheapest of this card i have found anywhere else.",
            "Love it: It’d awesome",
            "Awesome: Best card I ever had.",
            "Exactly what I was looking for and perfect for my application! Thanks!!: Exactly what I was looking for and perfect for my application! Thanks!!",
            "it works: work perfectly fine, only slight problem is the fans make a grinding sound sometimes",
            "over priced: Over Priced video card but mine died i work rendering cads, so far is been working good.",
            "1: Decent card. Does what it needs to do. Still over priced, but getting better",
            "Very Satisfied: Well-kept by previous owner. Very good performance for the money, in my opinion.",
            "Good: Got here fast.",
            "Well: Item good",
            "Good value for the price.: Good value for the price.",
            "Perfect, no problems. Running great.: Perfect, no problems. Running great.",
            "Quality: Works fine. Cooling is amazing !",
            "Plays  great: Plays WOW awrsome",
            "Noice: Good",
            "Great graphics card: I like this graphics card but it was too over priced",
            "The best for mining: Excellent product for mining. I have got 49 MHS It's a beast!",
            "10/10 would buy again: Great card, performs well, awesome manufacturer.",
            "good but but bot worth the scalper price: definitely not worth the price but a working 3060 is a 3060.",
            "Over priced, but had no choice: Over priced, but had no choice. It is a 3060 so it works",
            "Rtx 3060: Happy happy happy",
            "Great card, gaming like crazy!: Great experience all around.",
            "it eas all good: it was all good",
            "Worth the money: Works well, Easy to use",
            "RTX 3060 XC Gaming Review: Extremely quiet.",
            "A bit dusty but works good 👍 ...: A bit dusty but works good 👍",
            "EVGA RTX 3060: Value vs Price is unbeatable!",
            "yes very good: good yes very good",
            "Works great: Works great",
            "works good even tho mining is nerfed: works good even tho mining is nerfed",
            "Perfect card: The packaging was awful, but the card was just fine and worked as it should. 9/10",
            "Great product but overpriced: ￼",
            "Good  Graphics Card: Good  Graphics Card",
            "Amazing: Love it",
            "Thank you: Excellent Product",
            "Great Entry-Level RTX Card: More affordable card than the others, good entry-way to RTX functionality. EVGA also has great warranty options.",
            "Not new: Labeled as \"BRAND NEW SEALED\". Product was not sealed.",
            "not happy with the purchase: LHR card",
            "Buy it: Good power decent valueBetter than a 2070 slightly under 2070s",
            "Great Video Card: Everything went smooth",
            "Great for 1080p gaming.: no problem for 144hz",
            "IT a Good graphic card for a stater pc.: IT a Good graphic card for a stater pc.",
            "Efficient: Quiet. Fans don't need to work too hard. Efficient.",
            "The video card worked instantly. Recommended A++: The video card worked instantly. Recommended A++",
            "Thanks: Exactly as expected",
            "RTX 3060 Great Card: Great 30 series GPU.",
            "Outstanding: BEST SELLER ON EBAY",
            "Scam: Scammer",
            "EPIC: EPIC.",
            "GPU working well: Good.",
            "great video card: gta5 greatness",
            "Item came as described.: Item came as described.",
            "Excellent product: Excellent product",
            "Very good: Very good",
            "👍: works great",
            "Very good gpu: Good",
            "Very good: Very good rtx 3060",
            "working great: working great",
            "Me gusto: Excelente",
            "video card RTX 3060 XC: too expensive",
            "No quiero: Ya no lo quiero me lo estás dejando en 700 tengo otra oferta en 580 la coge o lo dejas"
        ]
    },
    {
        "name": "Nvidia GeForce RTX 3070",
        "link": "https://www.ebay.com/urw/NVIDIA-GeForce-RTX-3070-Founders-Edition-8GB-GDDR6-Graphics-Card-Dark-Platinum-Black/product-reviews/15041887013",
        "reviews": [
            "Very nice: It arrived quickly, and had the gpu and power connector in the box. This card I very quiet, and has very good temps. Nothing below 110 for on ultra settings 1080 p. Runs vr perfectly also.",
            "Lightly used it seems' runs great: No issues, it actually has less dust than my Rog Strix 1080ti I replaced it with haha.  I'm getting about 30% more FPS on almost MAX settings for most games at 1440p. On my 1080ti I played at Medium/High settings, super optimized and still got less FPS. Good upgradeRead full review...",
            "The Tough GPU: Love these graphics cards! They look great and have a substantial weight to them. I especially like the fan design with the outer ring attaching the fan blades together. Tough. Amazing design. Don't complain about the price, if you don't like the price don't buy one.Read full review...",
            "Great Gaming card: The 3070 is a great card for the mid-tier gamer.It will play games in 1080p and 4K. 1080p turned up to the max and 4K decently. It beats the previous generation cards and is somewhat futureproof. If you are a top tier gamer who has the best of everything,this is not your card.But if you want decent performance with ray tracing ,this is your card.Read full review...",
            "Great performance , Horrible Pricing: This card is very good and well made with the push pull configuration of the gpu . This in return makes the temps cool . Can run 1440p effortlessly and 4K gaming and medium - high settings depending on the game. My only issue is the price for this GPU …. Just wait till it’s normal MSRP and not scalper price Read full review...",
            "This is dope sauce so far. Got an RTX 3070 founders edition for $490 total. You can't just get that anywhere.: This is dope sauce so far. Got an RTX 3070 founders edition for $490 total. You can't just getthat anywhere. So far it it takes anything lightly and is super quiet. Doesn't leak oil. Like it a lot. Thank you.Read full review...",
            "Great video card for the value: The expertly designed GeForce RTX 3070 Founders Edition is not the absolute fastest video card on the planet, but it deals almost every other card on shelves today (barring its RTX 3080 and RTX 3090 kin) a brutal takedown. It earns our Editors’ Choice award and a perfect 5-star score as the best video-card value of this, or any, year.Read full review...",
            "Good Performance, Slightly Dirty: The card works great. Very high performance. It is a little noisy, and it was super dusty when I got it. There were also some weird brown marks on the outside, but they came off easily",
            "Looks great performs well.: Beautiful! The Founders Edition of the RTX3070 looks great and performs well. Very nice body heat sync and low profile. I appreciate the care in design.",
            "Best GPU for Mining ETH: Bought specifically for Mining. Currently doing 62.5 mh/s @ 111 watts with locked core clock on HiveOS. This is the best all-around GPU for Mining ETH when it comes to hash rate and power consumption. Only downside is the price you have to pay to own them. Read full review...",
            "Great Card, but expensive: Card performs better than expected. My only issue is that you have to pay double the MSRP price to attain one unless you get lucky enough to pick one up at a retailer.",
            "Great cards but way too expensive: We needed cards in a hurry for an engineering project. we had to pay >2x MSRP but that's where we are right now I guess.The cards themselves are great",
            "Great card!: no real cons that ive noticed, preforms great with every game ive got so far like FF14, WoW, Genshine impact to name a few",
            "High quality product: Very good product.  Very expensive due to product shortages.",
            "Works as expected.: Runs quietly with expected performance and has no visible damage. With a price of $350, it is definitely worth it to pick up one of these.",
            "Nice!: Performing super well after undervolting, really nice card. Only thing i find annoying is that u need the adapter that comes with it but no big deal.",
            "Great Value for RTX 3070 graphics card: Great price on a RTX 3070! Why pay more for a new 3060 when you can have a better graphics card for less.",
            "Great product: This product came as it said it would, and I have had no issues besides the connector was a little worn out. I’m the end it works just fine though.",
            "Amazing Shipper.: I’m well aware that I overpaid, but that was of my own discretion. This shipper took good care of the product, and shipped using expedited. Came in original, unopened box, as advertised. No issues to report.",
            "Stylish, Excellent GPU that costs too much these days (unless you get lucky): Awesome card but cant get it for anywhere close to MSRP :(",
            "Te best GPU I've ever used!: Even if it's not the 3080, It can run games in 2k and Ultra settings with no problem at all.",
            "Nvidia RTX 3070 Founders Edition: This card is exactly what I needed!! For my first official pc build I wanted something that could handle a heavy workload and operate with ease. This card is just that.",
            "3070 FE: Great looking and great performing graphics card. Easily a solid performer.",
            "Gaming works much better now.: Works ad spec cheaper than newer cards",
            "A Go-To For Single PC Streaming: The card is certainly a powerhouse for single pc streaming in the market right now. Paired with a 5800x ocd to run at it's max boost clock, I can stream Cyberpunk 2077 at near max graphics with ray tracing enabled and dlss set to quality at 55-70 fps.",
            "Exactly as described.: Exactly as described.  Used video card in good shape that works.",
            "Works great: Non LHR 3070 working as expected. Expensive as usual for GPU’s now days.",
            "Lightweight, fast, smooth performance.: Expensive, but I got what I wanted.",
            "Works very well, and decent price.: Works exactly as it should, very quiet, and pretty decent price. Couldn't be happier.",
            "The truth: Very good Graphics card if purchased at Msrp ! Or no more than $100 over msrp",
            "Fast!: Fast!  Had some issues with the driver, but NVIDIA resolved them quickly.",
            "Fantastic: Even though I paid almost double the MSRP it was worth every penny. Still less than the 2080ti from last model and just as good performance.",
            "3070: came as expected and it was exactly what i needed. w product.",
            "It was definitely handled with care. Very excited to have this product: It was definitely handled with care. Very excited to have this product",
            "Great product, scalper prices: Scalper prices but a great product",
            "beauty is expensive.  (well, GPUs are): this thing is beautiful.  I got 2.",
            "I was to excited.: I could have waited to purchase this item when it was available in stores but I couldn't wait.",
            "Great card for gaming.........: I use it for mining, gets decent hash rate but gets more rejections than a guy with warts on his face.",
            "Works great, very well cleaned!: Works great, very well cleaned!",
            "Great graphic card: Works fantastic and is very quiet",
            "Excellent: Works great, fast and easy.",
            "All good: All good thanks",
            "Amazing: It’s perfect and I couldn’t ask for more",
            "It's a Beast.: Replaced my RTX 2070 XC Ultra!",
            "Excellent: As described. Awesome card.",
            "I like the card: Great card",
            "Rtx 3070: Works great",
            "Nvidia GPU Card: Great card.",
            "Trust it: As advertised 5/5!",
            "Good: Very high performance.",
            "Nice GPU: it's nice",
            "simply the best: exactly as specified, new and performs excellent",
            "Great: I’m happy with",
            "10/10: 10/10 works perfectly 👍🏾",
            "Fantastic and worked better than expected: Fantastic and worked better than expected",
            "Got here surprisingly quick: It’s pretty good chief no complaints",
            "Great buy: 10/10",
            "Lovely: I couldn't be happier with this card!",
            "Great card: This card is amazing",
            "AMAZING CARD: The 3070 Founders Edition is incredible definitely worth the upgrade from the 2070 Super by a mile!! I can play games are 120+ FPS always 1440p and on high settings. Excellent card worth every penny!!!",
            "Impressive graphics card: Impressive graphics card",
            "good: very good price best ever qeite as a muse",
            "This card is a beast: NVIDIA hit it out of the park with the RTX 3000 series. They are performance beasts and the 3060 ti and 3070 are a fantastic value. Ray tracing and DLSS are game changers!",
            "LOVE IT: Amazing graphics card! Can't believe I waited this long to upgrade.",
            "It’s a decent card: I think it’s a good value with good performance.",
            "Lightweight: Good item",
            "Best GPU I’ve owned: Great, quiet. Plays almost anything fine",
            "Do not buy: Do not get scalped this guy is charging 3x the price please be aware everyone",
            "Hahaha: What a nice purchase here thank you for making that happened !",
            "Great stuff: Fantastic! Simply stunning clarity, I'm truly jealous.",
            "BUY IT NOW YOU BOT AHAHAH: Wow!!!! Such a great deal!",
            "Great product!!!: Great product!!!",
            "performance vs cost: good performance, quiet but expensive",
            "3060ti: Great card!",
            "nice: amazing",
            "nice: nice",
            "Muy buen estado funciona perfectamente l...: Muy buen estado funciona perfectamente lo único que el conector  de alimentación tiene algunos cables sueltos"
        ]
    },
    {
        "name": "Nvidia GeForce RTX 3080",
        "link": "https://www.ebay.com/urw/NVIDIA-GeForce-RTX-3080-Founders-Edition-10GB-GDDR6X-Graphics-Card-Titanium-Black/product-reviews/4040934334",
        "reviews": [
            "The 3080 was double boxed with bubble wrap. It looked brand new out of the box. The only indication it used was a little dust on the edge of a fan. So: The 3080 was double boxed with bubble wrap. It looked brand new out of the box. The only indication it used was a little dust on the edge of a fan. So was very well taken care of and worked flawlessly. Overall very happy with this order and would purchase from you again. Thank you!",
            "Graphics card has very noticeable whine ...: Graphics card has very noticeable whine when the fans spin up. Was somewhat dirty and need a quick dusting. Works well. Fan bearings seem worn and are loud.",
            "Very Decent, Older, Entry Level Biginner Class GPU: I specifically wanted this GPU, in order to use a vertically mounted EK \"Special Edition\" water block, in an elite class water cooled video editing, work station custom computer. I'll switch to an Nvidia RTX 4090 FE, if and when EK decides to offer the \"Special Edition\" water block for the 4090. The basic Nvidia GeForce RTX 3080 is what I would consider a decent, entry level beginner class graphics card. The 12GB version would be preferred. The 3080 cards are outdated, over priced and not a good value today. You're better off going with an RTX 4070 or 70Ti, when they are available, unless you have a special need for the Nvidia RTX 3080 FE Edition, as in my case.",
            "Good card but covered in dust.: The Card has performed well so far. I was quite disappointed when I received the card and it was almost completely caked in dust. There was little attempt to clean it, just wiped off the fans basically. Haven't seen any lack in performance yet but I haven't pushed the card at all.",
            "Best 3080 out there: I already have the Asus Tuf 3080 and both the EVGA FTW3 3080 and 3080ti. I can tell you the Strix 3080 is a cut above these two cards. Great temps. The Strix does draw more power than the Tuf. The Tuf version actually works quite well and has good thermals. The Strix is better but it also clocks higher and consumes 30 to 59 more watts. With the TUF and FTW3, I’ve had problems with paste pump-out. Just the design. Not sure if the Strix has the same problem, but so far the temps are great.",
            "3080: So overall decent.. could definitely tell its been in a mining rig for well over a year. Runs a little hot, not unusable though. Condition wasn't bad either, would almost have looked new with a good cleaning. Overall 4.3/5",
            "Looks good, works gooder: I'm loving my 3080 FE, for the deal I got it at it's incredible compared to my old single fan 1070. A decent bit louder, but not obnoxious, and well worth the performance increase. 6/5 stars as far as I'm concerned. I run just about everything on Ultra/High at 144fps 2560x1440 with it.",
            "Great!: Can be a bit loud when spun up all the way, but I also have an open case so it does nothing to help this.  Works great.  Extremely sturdy, great build quality.  Performs like you'd expect, that is to say, excellently!",
            "NVIDIA GeForce RTX 3080 Founders Edition 10GB GDDR6X Graphics Card: Great card for gaming. The founders edition 3070/3080 are the best card for gpu etherium mining and are never LHR making founders edition cards more valuable. This 3080 shroud is more compact than my 3rd party 3070 so its easier to fit in my case.",
            "3080 oh my: This is one of the best bang for your buck graphics card. It’s perfect for someone who wants something a little higher end for gaming, streaming, and editing. If you’re able to snag one for a price that fits your budget I’d say go for it.",
            "High-performance, quiet, compact, lightweight.: The graphics card is great for overclocking the video memory (+1230 MHz).Quiet, compact, lightweight, fits almost any case and does not require a video card holder",
            "Great second hand product!!: Has a little visible signs of usage. No cooling upgrades during mining.",
            "Works great :): Was a bit nervous ordering used through Ebay, but this came in the original packaging, and very clean with no dust. Installed it today along with my new PSU and it is working great so far. Highly recommend!",
            "overheats; replace thermals mandatory; good product: Price is cutthroat and Founders Edition has very bad overheating on the V.RAM. That being said, it's exactly what I expected and if the thermal pads are replaced this is a monster of a GPU that is completely unmatched. So I still give 5 star.",
            "Great!: After using the 3080 for about a week it is amazing, the card itself did come a bit dusty but it was easy to clean.",
            "Great Product. Works as anticipated.: Runs most of my games at 4k 60 which was my main requirement. Good performance for a good price",
            "Arrived early, worth the price and works like a dream.: Works like a dream. That's all it takes to be a 5 star product in my eyes.",
            "As advertised: My RTX3080 was sent to ups the same day I ordered it. It arrived in the original box, with all accessories and it was very clean. I installed it and everything worked perfectly. Not much else to add to that except that  I am very happy with the whole experience.",
            "Amazing: So happy I was able to get a rtx 3080 I love it",
            "Loud and good performance: Loud but preforms as expected",
            "High price but better than many others.: So many are charging way more this one. It works well and performs as expected.",
            "Great card for the money: Was clean, functional, allowed me to game at max settings.",
            "Great person to work with.: Payed way to much for it. But that is the nature of GPU's these days",
            "Rtx 3080 works great for gaming.: Works great awesome value for the card I got",
            "Works great!, runs all of my games at 1440p and even 4K with ease: Works great!, runs all of my games at 1440p and even 4K with ease",
            "Great product: Product works great tiny bit of dust but it’s expected",
            "Excellent: It's pretty amazing, but still fairly overpriced.",
            "the upgrade I needed: Great condition only needed to remove some dust but it operates very well.",
            "LOVE IT!: First time own 80 series Nvidia card! I always bought 60 or 70 series in last 15 year.",
            "Great gpu: Awesome gpu , great performance",
            "great card for a ridiculous price.: Best card for gaming, aside from the price..",
            "Get a warranty!!!: So many of these failing ,  the fans are junk and most need repadding within a month. so best buys $200 paywall makes these $899 with an extended warranty which isn't bad and they are increasingly available. They actually had them in STOCK at microcenter last week !  With tens of thousands of cards finally reaching ports in the USA  the GPU crunch is almost over thank god!",
            "This could be a hack problem?: when the computer starts the product stops when you stop the computer it starts but for a moment.",
            "As described: Got this for my son’s birthday and he is over the moon happy!",
            "Killer product destructive price: Awesome hardware and tech, not so awesome price tag especially when msrp is so low comparatively",
            "Very powerful: I like this one",
            "Founder's edition RTX 3080: The graphics card performed flawlessly and I was very impressed with the Packaging.",
            "GeForce RTX3080: Works as expected.",
            "Works great!: Works great!",
            "Awesome thank you!: Awesome thank you!",
            "awesome!!!  it was perfect: I am so excited with it.  Loving it",
            "just like what I expected: just like what I expected",
            "great for price: Works great for the retail price of $700! doubles the performance of my 2070",
            "very desperate: this card is definitely a good sale",
            "Great: Maybe a little big but great",
            "BenchmarksOverhyped: Gigabyte accidentally released info on an upcoming 20GB model for the 3080 including 3070 Super with 16GBs. The value of this isn’t worth it.",
            "Overpriced Scam: For $2000, it is extremely loud and performs horribly. I would expect better for $2000. A card like this should sell for around $800. Oh, wait....",
            "Save your money: Buying scalped product doesn’t helped the problem save your money and wait for the chip shortage to end so that scalpers will lose their money.",
            "Paper doesn’t meet standards: Paper was thin and ripped on contact. Ruined the whole experience",
            "Great performance: Next level performance",
            "Scalper: Nice scalp buddy",
            "Scum: Not worth the price. Greedy people.",
            "I will purchase, when pigs fly: Awesome price",
            "OVERPRICED: DON'T BUY OVERPRICED!",
            "3080 FE: All good!  Thanks",
            "Good gpu: Good gpu",
            "Super!: Super!"
        ]
    }
]